# 직접 해보세요!
## 제곱 함수와 n 제곱 함수 만들기(202쪽)

### 메서드 비교
1. agg
- 각 요소(컨테이너, 시리즈)에 대해 reduce 연산
- df, group(sub_series로 이루어짐)만 연산 가능
- 시리즈의 각 요소는 스칼라이기때문에 더이상 reduce 할 수 없어서 agg 적용불가

2. map
- 함수를 인자로 받아서 변형
- series
- 벡터의 각 요소를 받아 (동일한)함수를 적용하여 변형

3. transform
- 함수를 인자로 받아서 변형
- df, group
- 2차원 공간에 있는 각 요소 시리즈들을 1대1 대응해서 다른 시리즈들로 만듦
- 사이즈 동일
- 첫번째 시리즈 func1, 두번째 시리즈 func2... 이런식으로 각 시리즈별로 다른 함수 적용 가능

4. applymap
- 함수를 인자로 받아서 변형
- df
- 2차원에 있는 각 요소를 (동일한)함수를 적용하여 변형 (2차원으로)

5. apply
- 메소드를 호출한 컨테이너의 각 요소에 대한 reduce, map, 기타등등의 연산 가능
- 각각 다른 함수를 적용할수는 없음
- 컬럼별로 동일한 연산 가능
- df, group

In [6]:
df = pd.DataFrame(
    {'a': [0,3,3,9,12],
     'b': [1,4,7,10,13],
     'c': [2,5,8,11,14]}
)
df

    a   b   c
0   0   1   2
1   3   4   5
2   3   7   8
3   9  10  11
4  12  13  14

In [7]:
df.agg(['mean','sum'])  #열마다 reduce

         a     b     c
mean   5.4   7.0   8.0
sum   27.0  35.0  40.0

In [8]:
df.agg({'a':['mean','min'],'b':'sum','c':'sum'})

        a     b     c
mean  5.4   NaN   NaN
min   0.0   NaN   NaN
sum   NaN  35.0  40.0

In [9]:
df.apply(['mean','sum'])

         a     b     c
mean   5.4   7.0   8.0
sum   27.0  35.0  40.0

In [10]:
df['a'].map(np.sqrt) #series에만 map 가능

0    0.000000
1    1.732051
2    1.732051
3    3.000000
4    3.464102
Name: a, dtype: float64

In [ ]:
df.transform([np.sqrt,np.exp]) # 1대1 대응으로 각각 함수 적용 가능

In [20]:
df['a'].apply([np.sqrt,np.exp])  ## apply도 여러 함수 가능

       sqrt            exp
0  0.000000       1.000000
1  1.732051      20.085537
2  2.449490     403.428793
3  3.000000    8103.083928
4  3.464102  162754.791419

In [21]:
df.apply([np.sqrt,np.exp])

          a                        b                        c
       sqrt            exp      sqrt            exp      sqrt           exp
0  0.000000       1.000000  1.000000       2.718282  1.414214  7.389056e+00
1  1.732051      20.085537  2.000000      54.598150  2.236068  1.484132e+02
2  2.449490     403.428793  2.645751    1096.633158  2.828427  2.980958e+03
3  3.000000    8103.083928  3.162278   22026.465795  3.316625  5.987414e+04
4  3.464102  162754.791419  3.605551  442413.392009  3.741657  1.202604e+06

In [22]:
df.applymap(np.sqrt)   #applymap은 하나의 함수만 가능(전체 df에 대해)

          a         b         c
0  0.000000  1.000000  1.414214
1  1.732051  2.000000  2.236068
2  2.449490  2.645751  2.828427
3  3.000000  3.162278  3.316625
4  3.464102  3.605551  3.741657

In [23]:
def my_sq(x):
    return x ** 2

In [24]:
def my_exp(x, n):
    return x ** n

In [25]:
print(my_sq(4))

16

In [26]:
print(my_exp(2, 4))

16

# 직접 해보세요!
## 시리즈와 데이터프레임에 apply 메서드 사용하기(203쪽)

### 1. 시리즈와 apply 메서드

In [27]:
import pandas as pd

df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]}) 

print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [28]:
print(df['a'] ** 2)

0    100
1    400
2    900
Name: a, dtype: int64

In [29]:
sq = df['a'].apply(my_sq) 
print(sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [32]:
ex = df['a'].apply(my_exp, n=2)   #my_exp 함수의 파라미터도 같이 주네
print(ex)

0    100
1    400
2    900
Name: a, dtype: int64

In [9]:
ex = df['a'].apply(my_exp, n=3) 
print(ex)

0     1000
1     8000
2    27000
Name: a, dtype: int64

### 5. 데이터 프레임과 apply 메서드

In [5]:
df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]}) 
print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [33]:
def print_me(x): 
    print(x)

In [34]:
print(df.apply(print_me, axis=0))

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    None
b    None
dtype: object

In [36]:
print(df.apply(print_me, axis=1))

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64
0    None
1    None
2    None
dtype: object

In [8]:
print(df['a'])

0    10
1    20
2    30
Name: a, dtype: int64

In [9]:
print(df['b'])

0    20
1    30
2    40
Name: b, dtype: int64

In [37]:
def avg_3(x, y, z):
    return (x + y + z) / 3

In [38]:
print(df.apply(avg_3))

TypeError: ("avg_3() missing 2 required positional arguments: 'y' and 'z'", 'occurred at index a')

In [40]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [39]:
def avg_3_apply(col):
    x = col[0] 
    y = col[1] 
    z = col[2] 
    return (x + y + z) / 3

# apply는 시리즈가 들어가기 때문에 함수 수정. 각 시리즈의 0,1,2번째 요소들을 더하고 3으로 나눔
print(df.apply(avg_3_apply))

a    20.0
b    30.0
dtype: float64

In [41]:
def avg_3_apply(col):
    sum = 0
    for item in col:
         sum += item
    return sum / df.shape[0]

In [44]:
def avg_3_prc(col):
    return np.mean(col)
print(df.apply(avg_3_prc))    
print(df.apply(avg_3_prc, axis=1))

a    20.0
b    30.0
dtype: float64
0    15.0
1    25.0
2    35.0
dtype: float64

In [31]:
def avg_2_apply(row):
    sum = 0
    for item in row:
        sum += item
    return sum / df.shape[1]

In [32]:
print(df.apply(avg_2_apply, axis = 1))

0    15.0
1    25.0
2    35.0
dtype: float64

In [117]:
tips tiprate를 구하고
sort_values 하는 함수 만들어
sex,time별로 group하여 함수 적용(apply)

SyntaxError: invalid syntax (<ipython-input-117-5e04ee03fe44>, line 1)

In [84]:
import seaborn as sns
tips = sns.load_dataset('tips')


tips['tip_rate']= (tips['tip']/tips['total_bill'])*100

In [85]:
tips

     total_bill   tip     sex smoker   day    time  size   tip_rate
0         16.99  1.01  Female     No   Sun  Dinner     2   5.944673
1         10.34  1.66    Male     No   Sun  Dinner     3  16.054159
2         21.01  3.50    Male     No   Sun  Dinner     3  16.658734
3         23.68  3.31    Male     No   Sun  Dinner     2  13.978041
4         24.59  3.61  Female     No   Sun  Dinner     4  14.680765
..          ...   ...     ...    ...   ...     ...   ...        ...
239       29.03  5.92    Male     No   Sat  Dinner     3  20.392697
240       27.18  2.00  Female    Yes   Sat  Dinner     2   7.358352
241       22.67  2.00    Male    Yes   Sat  Dinner     2   8.822232
242       17.82  1.75    Male     No   Sat  Dinner     2   9.820426
243       18.78  3.00  Female     No  Thur  Dinner     2  15.974441

[244 rows x 8 columns]

In [ ]:
### SNS의 tips 데이터에서 sex와 time을 tipRate top5를 구하시오

In [98]:
import seaborn as sns
tips = sns.load_dataset('tips')


tips['tip_rate']= (tips['tip']/tips['total_bill'])*100

def ft(df):
    return df.sort_values('tip_rate',ascending=False).head()
tips.groupby(['sex','time']).apply(ft)

                   total_bill   tip     sex smoker   day    time  size  \
sex    time
Male   Lunch  149        7.51  2.00    Male     No  Thur   Lunch     2
              194       16.58  4.00    Male    Yes  Thur   Lunch     2
              88        24.71  5.85    Male     No  Thur   Lunch     2
              222        8.58  1.92    Male    Yes   Fri   Lunch     1
              87        18.28  4.00    Male     No  Thur   Lunch     2
       Dinner 172        7.25  5.15    Male    Yes   Sun  Dinner     2
              232       11.61  3.39    Male     No   Sat  Dinner     2
              183       23.17  6.50    Male    Yes   Sun  Dinner     4
              181       23.33  5.65    Male    Yes   Sun  Dinner     2
              185       20.69  5.00    Male     No   Sun  Dinner     5
Female Lunch  221       13.42  3.48  Female    Yes   Fri   Lunch     2
              191       19.81  4.19  Female    Yes  Thur   Lunch     2
              139       13.16  2.75  Female     No  Thur   Lunch     2
              124       12.48  2.52  Female     No  Thur   Lunch     2
              140       17.47  3.50  Female     No  Thur   Lunch     2
       Dinner 178        9.60  4.00  Female    Yes   Sun  Dinner     2
              67         3.07  1.00  Female    Yes   Sat  Dinner     1
              109       14.31  4.00  Female    Yes   Sat  Dinner     2
              93        16.32  4.30  Female    Yes   Fri  Dinner     2
              51        10.29  2.60  Female     No   Sun  Dinner     2

                    tip_rate
sex    time
Male   Lunch  149  26.631158
              194  24.125452
              88   23.674626
              222  22.377622
              87   21.881838
       Dinner 172  71.034483
              232  29.198966
              183  28.053517
              181  24.217745
              185  24.166264
Female Lunch  221  25.931446
              191  21.150934
              139  20.896657
              124  20.192308
              140  20.034345
       Dinner 178  41.666667
              67   32.573290
              109  27.952481
              93   26.348039
              51   25.267250

# 직접 해보세요!
## 데이터프레임의 누락값을 처리한 다음 apply 메서드 사용하기(208쪽)

### 1. 데이터프레임의 누락값 처리하기 ― 열 방향

In [100]:
import seaborn as sns

titanic = sns.load_dataset("titanic")

In [101]:
print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB
None

In [10]:
import numpy as np

def count_missing(vec):
    null_vec = pd.isnull(vec)
    null_count = np.sum(null_vec)
    return null_count

In [104]:
import numpy as np

def count_missing(vec):
    return pd.isnull(vec).sum()

In [105]:
cmis_col = titanic.apply(count_missing)
print(cmis_col)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [109]:
def prop_missing(vec):   #결측률
    num = count_missing(vec)
    dem = vec.size
    return num / dem

In [110]:
pmis_col = titanic.apply(prop_missing)
print(pmis_col)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
num_missing    0.000000
dtype: float64

In [111]:
def prop_complete(vec):  #비결측률
    return 1 - prop_missing(vec)

### 8. 데이터프레임의 누락값을 처리하기 ― 행 방뱡

In [112]:
cmis_row = titanic.apply(count_missing, axis=1)
pmis_row = titanic.apply(prop_missing, axis=1)
pcom_row = titanic.apply(prop_complete, axis=1)

print(cmis_row.head()) #결측치 갯수

0    1
1    0
2    1
3    0
4    1
dtype: int64

In [113]:
print(pmis_row.head()) #결측률

0    0.0625
1    0.0000
2    0.0625
3    0.0000
4    0.0625
dtype: float64

In [114]:
print(pcom_row.head()) #비결측률

0    0.9375
1    1.0000
2    0.9375
3    1.0000
4    0.9375
dtype: float64

In [115]:
titanic['num_missing'] = titanic.apply(count_missing, axis=1)

print(titanic.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone  num_missing
0    man        True  NaN  Southampton    no  False            1
1  woman       False    C    Cherbourg   yes  False            0
2  woman       False  NaN  Southampton   yes   True            1
3  woman       False    C  Southampton   yes  False            0
4    man        True  NaN  Southampton    no   True            1

In [116]:
print(titanic.loc[titanic.num_missing > 1, :].sample(10)) #sample은 random하게 추출해서 10개

     survived  pclass     sex  age  sibsp  parch      fare embarked   class  \
47          1       3  female  NaN      0      0    7.7500        Q   Third
306         1       1  female  NaN      0      0  110.8833        C   First
154         0       3    male  NaN      0      0    7.3125        S   Third
739         0       3    male  NaN      0      0    7.8958        S   Third
511         0       3    male  NaN      0      0    8.0500        S   Third
481         0       2    male  NaN      0      0    0.0000        S  Second
466         0       2    male  NaN      0      0    0.0000        S  Second
497         0       3    male  NaN      0      0   15.1000        S   Third
470         0       3    male  NaN      0      0    7.2500        S   Third
538         0       3    male  NaN      0      0   14.5000        S   Third

       who  adult_male deck  embark_town alive  alone  num_missing
47   woman       False  NaN   Queenstown   yes   True            2
306  woman       False  NaN    Cherbourg   yes   True            2
154    man        True  NaN  Southampton    no   True            2
739    man        True  NaN  Southampton    no   True            2
511    man        True  NaN  Southampton    no   True            2
481    man        True  NaN  Southampton    no   True            2
466    man        True  NaN  Southampton    no   True            2
497    man        True  NaN  Southampton    no   True            2
470    man        True  NaN  Southampton    no   True            2
538    man        True  NaN  Southampton    no   True            2